---
kind: type
id: T:Autodesk.Revit.DB.ViewDisplayDepthCueing
source: html/3acdcd08-f0f1-f23b-94a2-90d1f4ca0eaf.htm
---
# Autodesk.Revit.DB.ViewDisplayDepthCueing

Represents the settings for depth cueing.

## Syntax (C#)
```csharp
public class ViewDisplayDepthCueing : IDisposable
```